#### Install Libaries

In [1]:
!pip install pandas
!pip install numpy
# !pip install openpyxl

Requirement already satisfied: pandas in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (2.3.4)

#### import Libaries

In [2]:
import pandas as pd
import numpy as np

#### Extration of data

In [3]:
df = pd.read_csv(r'./Sales Dataset.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1194 non-null   object
 1   Amount        1194 non-null   int64
 2   Profit        1194 non-null   int64
 3   Quantity      1194 non-null   int64
 4   Category      1194 non-null   object
 5   Sub-Category  1194 non-null   object
 6   PaymentMode   1194 non-null   object
 7   Order Date    1194 non-null   object
 8   CustomerName  1194 non-null   object
 9   State         1194 non-null   object
 10  City          1194 non-null   object
 11  Year-Month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

#### Data cleaning

In [5]:
### Formating data column names

df.columns = (
    df.columns.str.strip()
               .str.lower()
               .str.replace('-', '_', regex=True)
               .str.replace(' ', '_', regex=True)
)

In [6]:
df.columns

Index(['order_id', 'amount', 'profit', 'quantity', 'category', 'sub_category',
       'paymentmode', 'order_date', 'customername', 'state', 'city',
       'year_month'],
      dtype='object')

In [7]:
### Checking the information of the Data 

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [8]:
df = df.drop_duplicates().reset_index(drop=True) ### Droping duplicate if any 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   object
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   object
dtypes: int64(3), object(9)
memory usage: 112.1+ KB

In [9]:
df['order_date'] = pd.to_datetime(df['order_date'], format='%d/%m/%Y', errors='coerce' ) #formarting the order_date column to a date and time dataType
df['year_month'] = pd.to_datetime(df['year_month'], format='%Y-%m', errors='coerce')  #formarting the year_month column to a date and time dataType
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   datetime64[ns]
dtypes: datetime64[ns](2), int64(3), object(7)
memory usage: 112.1+ KB

In [10]:
df['match'] = (df['order_date'].dt.year == df['year_month'].dt.year) & \
              (df['order_date'].dt.month == df['year_month'].dt.month) #checking if the order_date == year_month

print(df['match'].drop_duplicates()) # droroping duplicate in the compare to see if we have a false but all are True so the both data are same so i can drop the year month column.

0    True
Name: match, dtype: bool

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
 11  year_month    1194 non-null   datetime64[ns]
 12  match         1194 non-null   bool
dtypes: bool(1), datetime64[ns](2), int64(3), object(7)
memory usage: 113.2+ KB

In [12]:
df = df.drop('match', axis='columns') # droping the match testing column 
df = df.drop('year_month', axis='columns') # droping the duplicated column

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1194 entries, 0 to 1193
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      1194 non-null   object
 1   amount        1194 non-null   int64
 2   profit        1194 non-null   int64
 3   quantity      1194 non-null   int64
 4   category      1194 non-null   object
 5   sub_category  1194 non-null   object
 6   paymentmode   1194 non-null   object
 7   order_date    1194 non-null   datetime64[ns]
 8   customername  1194 non-null   object
 9   state         1194 non-null   object
 10  city          1194 non-null   object
dtypes: datetime64[ns](1), int64(3), object(7)
memory usage: 102.7+ KB

In [14]:
### Spliting the name coulumn into firt name and last name base on 1NF

df[['first_name', 'last_name']] = df['customername'].str.split(' ', n=1, expand=True)

#### Creating a Product table

In [15]:
df_products = df[['category', 'sub_category']].copy().drop_duplicates().reset_index(drop=True)
df_products['product_id'] = df_products.index + 1
df_products = df_products[['product_id', 'category', 'sub_category']]
df_products

    product_id         category      sub_category
0            1      Electronics  Electronic Games
1            2      Electronics          Printers
2            3  Office Supplies              Pens
3            4      Electronics           Laptops
4            5        Furniture            Tables
5            6        Furniture            Chairs
6            7  Office Supplies           Markers
7            8        Furniture             Sofas
8            9  Office Supplies             Paper
9           10  Office Supplies           Binders
10          11      Electronics            Phones
11          12        Furniture         Bookcases

#### Creating a customer table

In [16]:
df_customers = (
    df[['first_name', 'last_name', 'state', 'city']]
    .copy()
    .drop_duplicates()
    .reset_index(drop=True)
)
df_customers['customer_id'] = df_customers.index + 1
# df_customers[['first_name', 'last_name']] = df_customers['customername'].str.split(' ', n=1, expand=True)
df_customers = df_customers[['customer_id', 'first_name', 'last_name', 'state', 'city']]
df_customers

     customer_id first_name last_name     state           city
0              1      David   Padilla   Florida          Miami
1              2     Connor    Morgan  Illinois        Chicago
2              3     Robert     Stone  New York        Buffalo
3              4       John    Fields   Florida        Orlando
4              5    Clayton     Smith   Florida          Miami
..           ...        ...       ...       ...            ...
802          803      Megan    Mclean  New York  New York City
803          804    Caitlin      Hunt  New York      Rochester
804          805      Jenna   Holland     Texas         Austin
805          806  Stephanie  Oconnell  New York        Buffalo
806          807     Andrea      Hill  Illinois        Chicago

[807 rows x 5 columns]

#### Creating an order table

In [17]:
df_orderss = (
    df[['order_id', 'order_date', 'amount', 'paymentmode', 'quantity', 'first_name', 'last_name', 'sub_category', 'state', 'city', 'profit']]
    .merge(df_customers[['customer_id', 'first_name', 'last_name', 'state', 'city']], 
           left_on=['first_name', 'last_name', 'state', 'city'], 
           right_on=['first_name', 'last_name', 'state', 'city'], 
           how='left', validate='many_to_one')
    .merge(df_products[['product_id', 'sub_category']], on='sub_category', how='left', validate='many_to_one')
).copy().drop_duplicates().reset_index(drop=True)
df_orderss['cost_per_unit'] = np.where(
    df_orderss['quantity'] != 0,
    ((df_orderss['amount'] - df_orderss['profit']) / df_orderss['quantity']).round(2),
    np.nan
)
df_orderss['price'] = (df_orderss['amount'] / df_orderss['quantity']).round(2)
df_orderss.insert(0, 'order_pk', df_orderss.index + 1)

df_orders = df_orderss[['order_pk', 'order_id', 'order_date', 'amount', 'paymentmode', 'quantity', 'customer_id', 'product_id', 'price']]

df_orders

,order_pk,order_id,order_date,amount,paymentmode,quantity,customer_id,product_id,price
0,1,B-26776,2023-06-27,9726,UPI,5,1,1,1945.20
1,2,B-26776,2024-12-27,9726,UPI,5,2,1,1945.20
2,3,B-26776,2021-07-25,9726,UPI,5,3,1,1945.20
3,4,B-26776,2023-06-27,4975,UPI,14,1,2,355.36
4,5,B-26776,2024-12-27,4975,UPI,14,2,2,355.36
...,...,...,...,...,...,...,...,...,...
1189,1190,B-26370,2024-07-31,8825,Debit Card,15,803,5,588.33
1190,1191,B-26298,2020-06-02,2082,EMI,8,804,11,260.25
1191,1192,B-26298,2022-12-15,2082,EMI,8,805,11,260.25
1192,1193,B-26298,2020-08-07,2082,EMI,8,806,11,260.25
1193,1194,B-25068,2024-10-26,914,UPI,13,807,7,70.31

#### Creating a revenue table

In [18]:

df_revenue = (
    df_customers[['customer_id']]
            .merge(df_orderss[['order_pk', 'order_id',
       'customer_id', 'product_id', 'profit', 'cost_per_unit']], on='customer_id', how='left')
            .merge(df_products[[ 'product_id']], on='product_id', how='left')
                  ).copy().drop_duplicates()

df_revenue['revenue_id'] = df_revenue.index + 1
df_revenue = df_revenue[['revenue_id', 'customer_id', 'order_pk', 'product_id', 'cost_per_unit', 'profit']]

df_revenue

      revenue_id  customer_id  order_pk  product_id  cost_per_unit  profit
0              1            1         1           1        1690.20    1275
1              2            1         4           2         260.36    1330
2              3            2         2           1        1690.20    1275
3              4            2         5           2         260.36    1330
4              5            3         3           1        1690.20    1275
...          ...          ...       ...         ...            ...     ...
1189        1190          803      1190           5         348.73    3594
1190        1191          804      1191          11         180.00     642
1191        1192          805      1192          11         180.00     642
1192        1193          806      1193          11         180.00     642
1193        1194          807      1194           7          57.77     163

[1194 rows x 6 columns]

#### Creating a Fast table

In [19]:


df_fact_table = (
    df_customers[['customer_id']]
            .merge(df_orderss[['order_pk', 'order_id', 'order_date', 'amount', 'paymentmode', 'quantity',
       'customer_id', 'product_id', 'price', 'profit', 'cost_per_unit']], on='customer_id', how='left')
            .merge(df_products[['category', 'sub_category' , 'product_id']], on='product_id', how='left')
          #   .merge(df[['profit', 'amount', 'order_date','order_id', 'first_name', 'last_name', 'state', 'city']], on=['first_name', 'last_name', 'state', 'city'],  how='left', validate='many_to_many'). reset_index(drop=True) 
                 ).copy().drop_duplicates().reset_index(drop=True)
df_fact_table['month'] = df_fact_table['order_date'].dt.strftime('%B')
df_fact_table['year'] = df_fact_table['order_date'].dt.year
df_fact_table['transaction_id'] = df_fact_table.index + 1
# df_fact_table = df_fact_table[['order_id', 'customer_id', 'city', 'category', 'sub_category', 'paymentmode', 'order_date', 'amount', 'profit', 'quantity']]
df_fact_table = df_fact_table[['transaction_id', 'customer_id', 'order_pk', 'order_date', 'amount', 'paymentmode',
       'quantity', 'product_id', 'price', 'profit', 'cost_per_unit',
        'month', 'year']]
df_fact_table

,transaction_id,customer_id,order_pk,order_date,amount,paymentmode,quantity,product_id,price,profit,cost_per_unit,month,year
0,1,1,1,2023-06-27,9726,UPI,5,1,1945.20,1275,1690.20,June,2023
1,2,1,4,2023-06-27,4975,UPI,14,2,355.36,1330,260.36,June,2023
2,3,2,2,2024-12-27,9726,UPI,5,1,1945.20,1275,1690.20,December,2024
3,4,2,5,2024-12-27,4975,UPI,14,2,355.36,1330,260.36,December,2024
4,5,3,3,2021-07-25,9726,UPI,5,1,1945.20,1275,1690.20,July,2021
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1189,1190,803,1190,2024-07-31,8825,Debit Card,15,5,588.33,3594,348.73,July,2024
1190,1191,804,1191,2020-06-02,2082,EMI,8,11,260.25,642,180.00,June,2020
1191,1192,805,1192,2022-12-15,2082,EMI,8,11,260.25,642,180.00,December,2022
1192,1193,806,1193,2020-08-07,2082,EMI,8,11,260.25,642,180.00,August,2020
1193,1194,807,1194,2024-10-26,914,UPI,13,7,70.31,163,57.77,October,2024

#### Importing Clean table into a CSV file

In [20]:
## Writing the clean data into a CSV file 

df_fact_table.to_csv('df_fact_table.csv', index=False)
df_revenue.to_csv('df_revenue.csv', index=False)
df_orders.to_csv('df_orders.csv', index=False)
df.to_csv('clean_sales_data.csv', index=False)
df_products.to_csv('df_products.csv', index=False)
df_customers.to_csv('df_customers.csv', index=False)

#### Analysing profit and loss and profit margin by customer

In [21]:
profit_loss = (
    df_customers[['customer_id', 'city']]
            .merge(df_fact_table[['customer_id', 'amount', 'profit', 'product_id']], on='customer_id', how='left')
            .merge(df_products[['product_id', 'category']], on='product_id', how='left')
            
    .groupby(['customer_id', 'city', 'category'])
    .agg(total_sales = ('amount', 'sum'),
         total_profit = ('profit', 'sum'))
         .reset_index()
)
profit_loss['status'] = ''
profit_loss['profit_margin_percentage'] = ''

for i in range(len(profit_loss['total_profit'])):
    if profit_loss.loc[i, 'total_profit'] > 0:
        profit_loss.loc[i, 'status'] = 'Profit'
    else:
        profit_loss.loc[i, 'status'] = 'Loss'

for i in range(len(profit_loss['total_profit'])):
    profit_loss.loc[i, 'profit_margin_percentage'] = ((profit_loss.loc[i, 'total_profit']/profit_loss.loc[i, 'total_sales']) *100).round(2)
        

profit_loss

,customer_id,city,category,total_sales,total_profit,status,profit_margin_percentage
0,1,Miami,Electronics,14701,2605,Profit,17.72
1,2,Chicago,Electronics,14701,2605,Profit,17.72
2,3,Buffalo,Electronics,14701,2605,Profit,17.72
3,4,Orlando,Office Supplies,1525,185,Profit,12.13
4,5,Miami,Office Supplies,1525,185,Profit,12.13
...,...,...,...,...,...,...,...
1029,803,New York City,Furniture,8825,3594,Profit,40.73
1030,804,Rochester,Electronics,2082,642,Profit,30.84
1031,805,Austin,Electronics,2082,642,Profit,30.84
1032,806,Buffalo,Electronics,2082,642,Profit,30.84
1033,807,Chicago,Office Supplies,914,163,Profit,17.83

#### Analysing month;y profit by category

In [22]:
month_profit_category = (
    df_fact_table[['order_date', 'product_id', 'profit']].merge(df_products[['product_id', 'category']], on='product_id', how='left')
    .groupby(['order_date', 'category'])
    ['profit'].sum()
            .reset_index()
            .sort_values('profit', ascending=False)
                ).reset_index(drop=True)
month_profit_category

    order_date         category  profit
0   2023-03-21      Electronics   11169
1   2023-09-27      Electronics    8840
2   2025-01-30      Electronics    8840
3   2022-04-15  Office Supplies    8742
4   2023-12-28      Electronics    8389
..         ...              ...     ...
935 2021-11-20  Office Supplies      58
936 2025-03-15      Electronics      58
937 2022-12-16        Furniture      55
938 2021-09-06        Furniture      55
939 2021-05-25        Furniture      54

[940 rows x 3 columns]

#### Analysing Profit made by month and year

In [23]:
monthly_profit = (
    df_fact_table[['month', 'year', 'profit']]
    .groupby(['month', 'year'])['profit']
      .sum()
      .reset_index()
      .sort_values(['month', 'year'])
      .reset_index(drop=True)
)

monthly_profit

        month  year  profit
0       April  2020   36156
1       April  2021   18777
2       April  2022   28156
3       April  2023   22102
4       April  2024   34182
..        ...   ...     ...
56  September  2020   29876
57  September  2021   13592
58  September  2022   15425
59  September  2023   29086
60  September  2024   23265

[61 rows x 3 columns]

#### Analysing Profit by customers

In [24]:
top_customers = (
    df_customers[['customer_id', 'first_name', 'last_name']]
    .merge(df_fact_table[['customer_id', 'profit']], on='customer_id').reset_index(drop=True)
    .groupby(['first_name', 'last_name'])['profit']
              .sum()
              .reset_index()
              .sort_values('profit', ascending=False)
              .reset_index(drop=True)
)
top_customers

    first_name         last_name  profit
0    Stephanie           Manning    8840
1        Logan          Galloway    8840
2         Cory             Evans    7790
3          Mr.  Ralph Garcia Jr.    7275
4     Nicholas           Johnson    7198
..         ...               ...     ...
797        Dr.    Terry Alvarado      58
798   Michelle          Williams      55
799        Jon             Banks      55
800   Victoria         Bryant MD      54
801    Russell            Austin      52

[802 rows x 3 columns]

#### Analysing quanty by category

In [25]:
quantity_per_category  = (
    df_products[['category','product_id']].merge(df_fact_table[['product_id', 'quantity']], )
    .groupby([ 'category'])['quantity']
              .sum()
              .reset_index()
              .sort_values('quantity', ascending=False)
              .reset_index(drop=True)
)
quantity_per_category

          category  quantity
0        Furniture      4441
1      Electronics      4258
2  Office Supplies      4046

#### Analysing Profit by city from the highest

In [26]:
city_with_low_profit = (
    df_customers[['customer_id', 'city']].merge(df_fact_table[['customer_id', 'profit']])
    .groupby([ 'city'])['profit']
              .sum()
              .reset_index()
              .sort_values('profit', ascending=True)
              .reset_index(drop=True)
)

city_with_low_profit

             city  profit
0        Columbus   56277
1     Los Angeles   69264
2           Tampa   70842
3         Houston   72659
4          Peoria   76106
5      Cincinnati   78788
6         Chicago   80061
7       Cleveland   81454
8          Austin   82638
9     Springfield   84205
10  New York City   86954
11      San Diego  101444
12         Dallas  102483
13  San Francisco  108106
14      Rochester  109729
15          Miami  109739
16        Buffalo  111823
17        Orlando  128125

#### Analysing city with the highest revenue over 95%

In [27]:
Cities_with_revenue= df_customers[['customer_id', 'city']].merge(df_fact_table[['customer_id', 'cost_per_unit', 'quantity']], on='customer_id', how='left')
# grouped_revenue = df.groupby('Product')['Revenue'].sum()
Cities_with_revenue['revenue'] = Cities_with_revenue['cost_per_unit']*Cities_with_revenue['quantity']


# Compute total revenue per city
city_revenue = Cities_with_revenue.groupby('city', as_index=False)['revenue'].sum()

# Calculate the 95th percentile of revenue
threshold = city_revenue['revenue'].quantile(0.95)

# Filter cities with revenue above the 95th percentile
top_cities = city_revenue[city_revenue['revenue'] > threshold]

# Display the result
top_cities

             city    revenue
15  San Francisco  331893.75

#### Analysing revenue made by month and year

In [28]:


monthly_sales = df_fact_table[['product_id', 'month', 'year']].reset_index(drop=True)
monthly_sales['revenue'] = Cities_with_revenue[['revenue']]

# # Aggregate total revenue per product per month
monthly_sales = monthly_sales.groupby(['product_id', 'month', 'year'])\
                    ['revenue'].sum().reset_index()\
                    .sort_values(['month', 'year'])

monthly_sales

     product_id      month  year   revenue
0             1      April  2020   9206.94
48            2      April  2020  13080.01
93            3      April  2020   9329.02
189           5      April  2020   7862.00
238           6      April  2020   6399.02
..          ...        ...   ...       ...
332           7  September  2024   5504.00
381           8  September  2024   5270.01
429           9  September  2024   2548.04
528          11  September  2024  10976.88
572          12  September  2024   2774.94

[573 rows x 4 columns]

#### Analysing average monthly revenue per product

In [29]:
 # Calculate average monthly revenue per product
avg_monthly_sales = monthly_sales.groupby('product_id')['revenue'].mean().round(2).reset_index()
avg_monthly_sales.rename(columns={'revenue': 'avg_monthly_revenue'}, inplace=True)

avg_monthly_sales

    product_id  avg_monthly_revenue
0            1              8679.95
1            2              9335.56
2            3              7822.64
3            4              7373.56
4            5              9558.80
5            6              6718.97
6            7              9247.46
7            8              8683.94
8            9              7813.18
9           10              6246.82
10          11              7348.07
11          12              6708.29

In [30]:
df_fact_table

,transaction_id,customer_id,order_pk,order_date,amount,paymentmode,quantity,product_id,price,profit,cost_per_unit,month,year
0,1,1,1,2023-06-27,9726,UPI,5,1,1945.20,1275,1690.20,June,2023
1,2,1,4,2023-06-27,4975,UPI,14,2,355.36,1330,260.36,June,2023
2,3,2,2,2024-12-27,9726,UPI,5,1,1945.20,1275,1690.20,December,2024
3,4,2,5,2024-12-27,4975,UPI,14,2,355.36,1330,260.36,December,2024
4,5,3,3,2021-07-25,9726,UPI,5,1,1945.20,1275,1690.20,July,2021
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1189,1190,803,1190,2024-07-31,8825,Debit Card,15,5,588.33,3594,348.73,July,2024
1190,1191,804,1191,2020-06-02,2082,EMI,8,11,260.25,642,180.00,June,2020
1191,1192,805,1192,2022-12-15,2082,EMI,8,11,260.25,642,180.00,December,2022
1192,1193,806,1193,2020-08-07,2082,EMI,8,11,260.25,642,180.00,August,2020
1193,1194,807,1194,2024-10-26,914,UPI,13,7,70.31,163,57.77,October,2024

In [31]:
!pip install psycopg2-binary sqlalchemy
# import psycopg2 as ps

Requirement already satisfied: psycopg2-binary in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (2.9.11)
Requirement already satisfied: sqlalchemy in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (2.0.44)
Requirement already satisfied: greenlet>=1 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\admin\documents\10alytics\platform for strategic retail decisions\platform-for-strategic-retail-decisions\.venv\lib\site-packages (from sqlalchemy) (4.15.0)

In [32]:
from sqlalchemy import create_engine, Column, Integer, String, Float, ForeignKey, Date, text
from sqlalchemy.orm import declarative_base, sessionmaker, relationship
Base = declarative_base()

#### Connecting the DB

In [33]:
engine = create_engine("postgresql+psycopg2://postgres:@localhost:5432/sales_intelligence")
print("✅ SQLAlchemy engine created successfully!")

✅ SQLAlchemy engine created successfully!

#### Creating of Schema

In [34]:
schema_name = "sales_info"

with engine.connect() as conn:
    conn.execute(text(f"CREATE SCHEMA IF NOT EXISTS {schema_name}"))
    conn.commit()

#### Drop tables if they exist

In [35]:
with engine.connect() as conn:
    conn.execute(text("DROP TABLE IF EXISTS sales_info.products CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS sales_info.customers CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS sales_info.orders CASCADE"))
    conn.execute(text("DROP TABLE IF EXISTS sales_info.revenue CASCADE"))
    conn.commit()

#### Creating tables

In [36]:
class Product(Base):
    __tablename__ = 'products'
    __table_args__ = {"schema": 'sales_info'}
    product_id = Column(Integer, primary_key=True, autoincrement=True)
    category = Column(String(50))
    sub_category = Column(String(50))
    
    # # Relationship to orders
    # orders = relationship("Order", back_populates="product")


# Base.metadata.drop_all(engine, checkfirst=True)  # checkfirst prevents errors if no tables exist

Base.metadata.create_all(engine, checkfirst=True)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [37]:
class Customer(Base):
    __tablename__ = 'customers'
    __table_args__ = {"schema": 'sales_info'}
    customer_id = Column(Integer, primary_key=True, autoincrement=True)
    first_name = Column(String(50))
    last_name = Column(String(50))
    city = Column(String(50))
    state = Column(String(50))
    
    # Relationship to orders
    # orders = relationship("Order", back_populates="customer")

Base.metadata.create_all(engine, checkfirst=True)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [38]:
class Orders(Base):
    __tablename__ = 'orders'
    __table_args__ = {"schema": 'sales_info'}
    order_pk = Column(Integer,  primary_key=True,  autoincrement=True)
    order_id = Column(String(8))
    order_date = Column(Date)
    amount = Column(Integer)
    paymentmode = Column(String(50))
    quantity = Column(Integer)
    customer_id = Column(Integer, ForeignKey('sales_info.customers.customer_id'))
    product_id = Column(Integer, ForeignKey('sales_info.products.product_id'))
    price = Column(Float)

Base.metadata.create_all(engine, checkfirst=True)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [39]:
class Revenue(Base):
    __tablename__ = 'revenue'
    __table_args__ = {"schema": 'sales_info'}
    revenue_id = Column(Integer, primary_key=True, autoincrement=True)
    customer_id = Column(Integer, ForeignKey('sales_info.customers.customer_id'))
    order_pk = Column(Integer, ForeignKey ('sales_info.orders.order_pk'))
    product_id = Column(Integer, ForeignKey('sales_info.products.product_id'))
    cost_per_unit = Column(Float)
    profit = Column(Integer)
    
    

Base.metadata.create_all(engine, checkfirst=True)
print("✅ Tables created successfully!")

✅ Tables created successfully!

In [40]:
df_products.to_sql('sales_info.products', engine, if_exists='append', index=False)
df_customers.to_sql('sales_info.customers', engine, if_exists='append', index=False)
df_orders.to_sql('sales_info.orders', engine, if_exists='append', index=False)
df_revenue.to_sql('sales_info.revenue', engine, if_exists='append', index=False)

194